neroroxxx/esp32/boards.txt
# Repackaged for use with BMC
# Official Espressif options
menu.UploadSpeed=Upload Speed
menu.USBMode=USB Mode
menu.CDCOnBoot=USB CDC On Boot
menu.MSCOnBoot=USB Firmware MSC On Boot
menu.DFUOnBoot=USB DFU On Boot
menu.UploadMode=Upload Mode
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM
menu.LoopCore=Arduino Runs On
menu.EventsCore=Events Run On
menu.MemoryType=Memory Type
menu.EraseFlash=Erase All Flash Before Sketch Upload
menu.JTAGAdapter=JTAG Adapter
menu.ZigbeeMode=Zigbee Mode
menu.PinNumbers=Pin Numbering

# Custom options
menu.Revision=Board Revision
menu.LORAWAN_REGION=LoRaWan Region
menu.LoRaWanDebugLevel=LoRaWan Debug Level
menu.LORAWAN_DEVEUI=LoRaWan DevEUI
menu.LORAWAN_PREAMBLE_LENGTH=LoRaWan Preamble Length
menu.SLOW_CLK_TPYE=Slow Clk Type(only for LoRaWAN)
menu.einksize=E-Ink Display Size
menu.NetworkLogLevel=Network Log Level

##############################################################

esp32doit-devkit-v1.name=DOIT ESP32 DEVKIT V1

esp32doit-devkit-v1.bootloader.tool=esptool_py
esp32doit-devkit-v1.bootloader.tool.default=esptool_py

esp32doit-devkit-v1.upload.tool=esptool_py
esp32doit-devkit-v1.upload.tool.default=esptool_py
esp32doit-devkit-v1.upload.tool.network=esp_ota

esp32doit-devkit-v1.upload.maximum_size=1310720
esp32doit-devkit-v1.upload.maximum_data_size=327680
esp32doit-devkit-v1.upload.flags=
esp32doit-devkit-v1.upload.extra_flags=

esp32doit-devkit-v1.serial.disableDTR=true
esp32doit-devkit-v1.serial.disableRTS=true

esp32doit-devkit-v1.build.tarch=xtensa
esp32doit-devkit-v1.build.bootloader_addr=0x1000
esp32doit-devkit-v1.build.target=esp32
esp32doit-devkit-v1.build.mcu=esp32
esp32doit-devkit-v1.build.core=esp32
esp32doit-devkit-v1.build.variant=doitESP32devkitV1
esp32doit-devkit-v1.build.board=ESP32_DEV

esp32doit-devkit-v1.build.f_cpu=240000000L
esp32doit-devkit-v1.build.flash_mode=dio
esp32doit-devkit-v1.build.flash_size=4MB
esp32doit-devkit-v1.build.boot=dio
esp32doit-devkit-v1.build.partitions=default
esp32doit-devkit-v1.build.defines=
esp32doit-devkit-v1.build.extra_flags=-DESP32 -include "{build.source.path}/config.h"

esp32doit-devkit-v1.menu.FlashFreq.80=80MHz
esp32doit-devkit-v1.menu.FlashFreq.80.build.flash_freq=80m
esp32doit-devkit-v1.menu.FlashFreq.40=40MHz
esp32doit-devkit-v1.menu.FlashFreq.40.build.flash_freq=40m

esp32doit-devkit-v1.menu.UploadSpeed.921600=921600
esp32doit-devkit-v1.menu.UploadSpeed.921600.upload.speed=921600
esp32doit-devkit-v1.menu.UploadSpeed.115200=115200
esp32doit-devkit-v1.menu.UploadSpeed.115200.upload.speed=115200
esp32doit-devkit-v1.menu.UploadSpeed.256000.windows=256000
esp32doit-devkit-v1.menu.UploadSpeed.256000.upload.speed=256000
esp32doit-devkit-v1.menu.UploadSpeed.230400.windows.upload.speed=256000
esp32doit-devkit-v1.menu.UploadSpeed.230400=230400
esp32doit-devkit-v1.menu.UploadSpeed.230400.upload.speed=230400
esp32doit-devkit-v1.menu.UploadSpeed.460800.linux=460800
esp32doit-devkit-v1.menu.UploadSpeed.460800.macosx=460800
esp32doit-devkit-v1.menu.UploadSpeed.460800.upload.speed=460800
esp32doit-devkit-v1.menu.UploadSpeed.512000.windows=512000
esp32doit-devkit-v1.menu.UploadSpeed.512000.upload.speed=512000

esp32doit-devkit-v1.menu.DebugLevel.none=None
esp32doit-devkit-v1.menu.DebugLevel.none.build.code_debug=0
esp32doit-devkit-v1.menu.DebugLevel.error=Error
esp32doit-devkit-v1.menu.DebugLevel.error.build.code_debug=1
esp32doit-devkit-v1.menu.DebugLevel.warn=Warn
esp32doit-devkit-v1.menu.DebugLevel.warn.build.code_debug=2
esp32doit-devkit-v1.menu.DebugLevel.info=Info
esp32doit-devkit-v1.menu.DebugLevel.info.build.code_debug=3
esp32doit-devkit-v1.menu.DebugLevel.debug=Debug
esp32doit-devkit-v1.menu.DebugLevel.debug.build.code_debug=4

esp32doit-devkit-v1.menu.EraseFlash.none=Disabled
esp32doit-devkit-v1.menu.EraseFlash.none.upload.erase_cmd=
esp32doit-devkit-v1.menu.EraseFlash.all=Enabled
esp32doit-devkit-v1.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################


esp32micromod.name=SparkFun ESP32 MicroMod

esp32micromod.bootloader.tool=esptool_py
esp32micromod.bootloader.tool.default=esptool_py

esp32micromod.upload.tool=esptool_py
esp32micromod.upload.tool.default=esptool_py
esp32micromod.upload.tool.network=esp_ota

esp32micromod.upload.maximum_size=1310720
esp32micromod.upload.maximum_data_size=327680
esp32micromod.upload.wait_for_upload_port=true
esp32micromod.upload.flags=
esp32micromod.upload.extra_flags=

esp32micromod.serial.disableDTR=true
esp32micromod.serial.disableRTS=true

esp32micromod.build.tarch=xtensa
esp32micromod.build.bootloader_addr=0x1000
esp32micromod.build.target=esp32
esp32micromod.build.mcu=esp32
esp32micromod.build.core=esp32
esp32micromod.build.variant=esp32micromod
esp32micromod.build.board=ESP32_MICROMOD

esp32micromod.build.f_cpu=240000000L
esp32micromod.build.flash_size=4MB
esp32micromod.build.flash_freq=40m
esp32micromod.build.flash_mode=dio
esp32micromod.build.boot=dio
esp32micromod.build.partitions=default
esp32micromod.build.defines=

esp32micromod.menu.PSRAM.disabled=Disabled
esp32micromod.menu.PSRAM.disabled.build.defines=
esp32micromod.menu.PSRAM.enabled=Enabled
esp32micromod.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue

esp32micromod.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
esp32micromod.menu.PartitionScheme.default.build.partitions=default
esp32micromod.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
esp32micromod.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
esp32micromod.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
esp32micromod.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
esp32micromod.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
esp32micromod.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
esp32micromod.menu.PartitionScheme.minimal.build.partitions=minimal
esp32micromod.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
esp32micromod.menu.PartitionScheme.no_ota.build.partitions=no_ota
esp32micromod.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
esp32micromod.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
esp32micromod.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
esp32micromod.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
esp32micromod.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
esp32micromod.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
esp32micromod.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
esp32micromod.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
esp32micromod.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
esp32micromod.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
esp32micromod.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
esp32micromod.menu.PartitionScheme.huge_app.build.partitions=huge_app
esp32micromod.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
esp32micromod.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
esp32micromod.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
esp32micromod.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
esp32micromod.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
esp32micromod.menu.PartitionScheme.fatflash.build.partitions=ffat
esp32micromod.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
esp32micromod.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
esp32micromod.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
esp32micromod.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728

esp32micromod.menu.CPUFreq.240=240MHz (WiFi/BT)
esp32micromod.menu.CPUFreq.240.build.f_cpu=240000000L
esp32micromod.menu.CPUFreq.160=160MHz (WiFi/BT)
esp32micromod.menu.CPUFreq.160.build.f_cpu=160000000L
esp32micromod.menu.CPUFreq.80=80MHz (WiFi/BT)
esp32micromod.menu.CPUFreq.80.build.f_cpu=80000000L
esp32micromod.menu.CPUFreq.40=40MHz (40MHz XTAL)
esp32micromod.menu.CPUFreq.40.build.f_cpu=40000000L
esp32micromod.menu.CPUFreq.26=26MHz (26MHz XTAL)
esp32micromod.menu.CPUFreq.26.build.f_cpu=26000000L
esp32micromod.menu.CPUFreq.20=20MHz (40MHz XTAL)
esp32micromod.menu.CPUFreq.20.build.f_cpu=20000000L
esp32micromod.menu.CPUFreq.13=13MHz (26MHz XTAL)
esp32micromod.menu.CPUFreq.13.build.f_cpu=13000000L
esp32micromod.menu.CPUFreq.10=10MHz (40MHz XTAL)
esp32micromod.menu.CPUFreq.10.build.f_cpu=10000000L

esp32micromod.menu.FlashMode.qio=QIO
esp32micromod.menu.FlashMode.qio.build.flash_mode=dio
esp32micromod.menu.FlashMode.qio.build.boot=qio
esp32micromod.menu.FlashMode.dio=DIO
esp32micromod.menu.FlashMode.dio.build.flash_mode=dio
esp32micromod.menu.FlashMode.dio.build.boot=dio

esp32micromod.menu.FlashFreq.80=80MHz
esp32micromod.menu.FlashFreq.80.build.flash_freq=80m
esp32micromod.menu.FlashFreq.40=40MHz
esp32micromod.menu.FlashFreq.40.build.flash_freq=40m

esp32micromod.menu.FlashSize.4M=4MB (32Mb)
esp32micromod.menu.FlashSize.4M.build.flash_size=4MB
esp32micromod.menu.FlashSize.8M=8MB (64Mb)
esp32micromod.menu.FlashSize.8M.build.flash_size=8MB
esp32micromod.menu.FlashSize.2M=2MB (16Mb)
esp32micromod.menu.FlashSize.2M.build.flash_size=2MB
esp32micromod.menu.FlashSize.16M=16MB (128Mb)
esp32micromod.menu.FlashSize.16M.build.flash_size=16MB

esp32micromod.menu.UploadSpeed.921600=921600
esp32micromod.menu.UploadSpeed.921600.upload.speed=921600
esp32micromod.menu.UploadSpeed.115200=115200
esp32micromod.menu.UploadSpeed.115200.upload.speed=115200
esp32micromod.menu.UploadSpeed.256000.windows=256000
esp32micromod.menu.UploadSpeed.256000.upload.speed=256000
esp32micromod.menu.UploadSpeed.230400.windows.upload.speed=256000
esp32micromod.menu.UploadSpeed.230400=230400
esp32micromod.menu.UploadSpeed.230400.upload.speed=230400
esp32micromod.menu.UploadSpeed.460800.linux=460800
esp32micromod.menu.UploadSpeed.460800.macosx=460800
esp32micromod.menu.UploadSpeed.460800.upload.speed=460800
esp32micromod.menu.UploadSpeed.512000.windows=512000
esp32micromod.menu.UploadSpeed.512000.upload.speed=512000

esp32micromod.menu.DebugLevel.none=None
esp32micromod.menu.DebugLevel.none.build.code_debug=0
esp32micromod.menu.DebugLevel.error=Error
esp32micromod.menu.DebugLevel.error.build.code_debug=1
esp32micromod.menu.DebugLevel.warn=Warn
esp32micromod.menu.DebugLevel.warn.build.code_debug=2
esp32micromod.menu.DebugLevel.info=Info
esp32micromod.menu.DebugLevel.info.build.code_debug=3
esp32micromod.menu.DebugLevel.debug=Debug
esp32micromod.menu.DebugLevel.debug.build.code_debug=4
esp32micromod.menu.DebugLevel.verbose=Verbose
esp32micromod.menu.DebugLevel.verbose.build.code_debug=5

esp32micromod.menu.EraseFlash.none=Disabled
esp32micromod.menu.EraseFlash.none.upload.erase_cmd=
esp32micromod.menu.EraseFlash.all=Enabled
esp32micromod.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################